Netology/src/DataProcessors/УстановкаЦенПродажи/УстановкаЦенПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановкаЦенПродажи</name>
</mdclass:DataProcessor>

Netology/src/InformationRegisters/ЦеныПродажиНоменклатуры/ЦеныПродажиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПродажиНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Netology/src/DataProcessors/УстановкаЦенПродажи/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Установить(Команда)

	УстановитьЦенуНаСервере();

КонецПроцедуры

&НаСервере
Процедура УстановитьФиксированнуюЦену(ВсяНоменклатураКОбработке)
	
	
	Для Каждого Номенклатура Из ВсяНоменклатураКОбработке Цикл

		МенеджерЗаписи = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Цена = ФиксированнаяЦена;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВариантУстановкиПриИзменении(Элемент)

	Элементы.ФиксированнаяЦена.Доступность = (ВариантУстановки = 0); 
	Элементы.ДатаАктуальности.Доступность = (ВариантУстановки = 2);
	
   КонецПроцедуры
   
&НаСервере
Процедура УстановитьЦенуНаСервере()

	ВсяНоменклатураКОбработке = НоменклатураКОбработке();
	
	Если ВариантУстановки = 0 Тогда
		УстановитьФиксированнуюЦену(ВсяНоменклатураКОбработке);
	ИначеЕсли ВариантУстановки = 1 Тогда
		УдалитьЦеныНоменклатуры(ВсяНоменклатураКОбработке);
	ИначеЕсли ВариантУстановки = 2 Тогда
		УстановитьЦеныНоменклатурыПроцентом(ВсяНоменклатураКОбработке);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЦеныНоменклатуры(ВсяНоменклатураКОбработке)                                                                 
	Для Каждого Номенклатура Из ВсяНоменклатураКОбработке Цикл
		НаборЗаписей = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);    
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
	
   &НаСервере
Процедура УстановитьЦеныНоменклатурыПроцентом(ВсяНоменклатураКОбработке)

	Для Каждого Номенклатура Из ВсяНоменклатураКОбработке Цикл

		ПоследняяЦена = ПолучитьПоследнююЦенуНоменклатуры(Номенклатура);
		
		Если ПоследняяЦена = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЦена = ПоследняяЦена * (1 + ПроцентОтТекущейЦены / 100); 

		УстановитьНовуюЦенуНоменклатуры(Номенклатура, НоваяЦена);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнююЦенуНоменклатуры(Номенклатура)

	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	
	ПоследняяЦена = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее( , Отбор);
	  
	Возврат ПоследняяЦена.Цена;
	
    КонецФункции

&НаСервере
Процедура УстановитьНовуюЦенуНоменклатуры(Номенклатура, Цена)

	МенеджерЗаписи = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Цена = Цена;
	МенеджерЗаписи.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	ДатаАктуальности = ТекущаяДата();

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.СписокНоменклатуры); 
	
КонецПроцедуры

&НаСервере
Функция НоменклатураКОбработке()

	ВсяНоменклатураКОбработке = Новый Массив;
	Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
		
		НоменклатураВСтроке = СтрокаСписка.Номенклатура;
		Если НоменклатураВСтроке.ЭтоГруппа Тогда
			ДополнитьМассивЭлементамиВложеннымиВГруппу(НоменклатураВСтроке, ВсяНоменклатураКОбработке);
		Иначе
			ВсяНоменклатураКОбработке.Добавить(НоменклатураВСтроке);
		КонецЕсли;
		
	КонецЦикла;

	Возврат ВсяНоменклатураКОбработке;

КонецФункции

Процедура ДополнитьМассивЭлементамиВложеннымиВГруппу(ГруппаНоменклатуры, ВсяНоменклатураКОбработке)

	Выборка = Справочники.Номенклатура.Выбрать(ГруппаНоменклатуры); 
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда                                                     
			ДополнитьМассивЭлементамиВложеннымиВГруппу(Выборка.Ссылка, ВсяНоменклатураКОбработке); 
		Иначе
			ВсяНоменклатураКОбработке.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбратока = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
	Возврат;
КонецЕсли;

Для Каждого ВыбранныеДанные Из ВыбранноеЗначение Цикл	
	СтрокаТаблицы = СписокНоменклатуры.Добавить();    
	СтрокаТаблицы.Номенклатура = ВыбранныеДанные;    
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыбранныеДанные);
КонецЦикла;

Элементы.СписокНоменклатуры.Обновить();   

КонецПроцедуры
